package ru.makhmudov.search_engine.test;

import org.apache.lucene.morphology.LuceneMorphology;
import org.apache.lucene.morphology.russian.RussianLuceneMorphology;

import java.io.IOException;
import java.util.Arrays;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.stream.Collectors;

public class Ss {
    public static void main(String[] args) throws IOException {
        String text = """
                Среди кукушковых ткачей, гнездовых паразитов родом из Африки, есть несколько экологических рас, которые откладывают яйца разного цвета — в зависимости от того, на каком виде птиц они специализируются. Орнитологи выяснили, что гены, отвечающие за расцветку яиц, находятся у ткачей на женской половой хромосоме, а каждая из экологических рас представляет собой эволюционную ветвь, в которой наследование идет по материнской линии. Эта особенность позволяет поддерживать фенотипическое разнообразие внутри одного вида и приспосабливаться к разным хозяевам. Впрочем, она же мешает комбинировать разные признаки в геноме одной особи. В отдаленной перспективе некоторые экологические расы кукушковых ткачей могут проиграть гонку вооружений со своими жертвами. Результаты исследования опубликованы в статье для журнала Proceedings of the National Academy of Sciences.

                Орнитологи давно заметили, что среди обыкновенных кукушек (Cuculus canorus) есть несколько экологических рас, паразитирующих на разных вида птиц. Самки каждой из таких рас откладывают яйца определенной расцветки, которая совпадает с расцветкой яиц их хозяев. Например, жертвами кукушек, откладывающих голубые яйца, обычно становятся горихвостки. Похожие экологические расы были обнаружены и у некоторых других пернатых гнездовых паразитов, которые эксплуатируют несколько видов хозяев.

                Пока остается неизвестным, как возникает и поддерживается такое фенотипическое разнообразие в пределах одного вида. Согласно наиболее популярной гипотезе, гены, ответственные за расцветку яиц, находятся на женской W-хромосоме и наследуются по материнской линии (в отличие от людей, у птиц гетерогаметный пол — женский). В первые месяцы жизни юная самка запоминает приемных родителей и в будущем подкалывает яйца представителям этого же вида. При этом самцы спариваются с самками независимо от того, к какой экологической расе те принадлежат.

                Попытки проверить эту идею до сих пор приводили к неоднозначным результатам. Так, исследователям удалось выяснить, что обыкновенные кукушки, откладывающие голубые яйца, относятся к одной эволюционной ветви с наследованием по материнской линии. Однако еще одна материнская линия кукушек включает особей, которые откладывают яйца разнообразной расцветки и паразитируют на разных видах птиц. А у больших медоуказчиков (Indicator indicator) были обнаружены две древние материнские линии. Представители первой выбирают в качестве приемных родителей для своих птенцов птиц, гнездящихся в норах, а представители второй — тех, что гнездятся на деревьях. Каждая из этих линий делится на более мелкие экологические расы, паразитирующие на конкретных видах птиц, однако эти расы уже не соответствуют вторичным материнским линиям.

                Команда орнитологов под руководством Клэр Споттисвуд (Claire N. Spottiswoode) из Кембриджского университета решила выяснить, как принадлежность к определенной экологической расе наследуется у кукушковых ткачей (Anomalospiza imberbis). Эти представители семейства вдовушек (Viduidae) обитают в Африке южнее Сахары и паразитируют на мелких певчих птицах — цистиколах (Cisticola) и приниях (Prinia). Самки ткачей выбрасывают хозяйские яйца и заменяют их собственными, а юные гнездовые паразиты так активно конкурируют со сводными братьями и сестрами за пищу, что те умирают от голода. В одном гнезде хозяев может развиваться сразу несколько птенцов ткачей.

                """;

        LuceneMorphology mor = new RussianLuceneMorphology();

        text = text.replaceAll("[^а-яА-Я]", " ").toLowerCase();
        List<String> wordList = Arrays.asList(text.split("\\s+"));
        List<String> rasList = wordList.stream()
                .filter(w -> w.startsWith("рас"))
                .collect(Collectors.toList());
        rasList.forEach(w -> System.out.println(mor.getNormalForms(w)));
        System.out.println();
    }
}
